"""Задание №1 Персональные данные."""
name = str(input("Введите своё имя:"))
residential_address = str(input("Введите адрес своего проживания"))
phone_number = str(input("Введите свой моб.телефон:"))
educational_institution = str(input("Введите название вашего учебного заведения "))
print(f"Имя:{name}\nАдрес проживания:{residential_address}\nНомер моб.телефона:{phone_number} \nНазвание учебного заведения:{educational_institution}")
